from markdown_strings import header, table, code_block,table_from_rows


default_list =[['1', '高端机械校准件技术-1 (LF~20/26.5GHz, SOTL类型，难度等级3.0)', '0分', '求职者简历中未提及机械校准件技术，缺乏直接相关经验。'],
                                 ['1', '高端机械校准件技术-1 (LF~20/26.5GHz, SOTL类型，难度等级3.0)', '0分', '求职者简历中未提及机械校准件技术，缺乏直接相关经验。'],
                                 ['2', '高端机械校准件技术-2 (LF~50/67GHz, SOTL类型，难度等级4.0)', '0分', '同样，简历中没有提到与高端机械校准件技术-2相关的经验或知识。'],
                                 ['1', '高端机械校准件技术-1 (LF~20/26.5GHz, SOTL类型，难度等级3.0)', '0分', '求职者简历中未提及机械校准件技术，缺乏直接相关经验。'],
                                 ['2', '高端机械校准件技术-2 (LF~50/67GHz, SOTL类型，难度等级4.0)', '0分', '同样，简历中没有提到与高端机械校准件技术-2相关的经验或知识。'],
                                 ['3', '高端机械校准件技术-3 (LF~110GHz, SOTL类型，难度等级5.0)', '0分', '简历中没有显示出求职者有110GHz频率范围内的机械校准件设计经验。'],
                                 ['1', '高端机械校准件技术-1 (LF~20/26.5GHz, SOTL类型，难度等级3.0)', '0分', '求职者简历中未提及机械校准件技术，缺乏直接相关经验。'],
                                 ['2', '高端机械校准件技术-2 (LF~50/67GHz, SOTL类型，难度等级4.0)', '0分', '同样，简历中没有提到与高端机械校准件技术-2相关的经验或知识。'],
                                 ['3', '高端机械校准件技术-3 (LF~110GHz, SOTL类型，难度等级5.0)', '0分', '简历中没有显示出求职者有110GHz频率范围内的机械校准件设计经验。'],
                                 ['4', '射频电子校准件技术 (LF~6/8GHz, 幅度校正0.1dB, 端口数2，难度等级3.0)', '30分', '虽然简历中没有直接提到射频电子校准件技术，但求职者有射频工程的工作经验，可能接触过相关技术。因此，给予一定的分数。'],
                                 ['1', '高端机械校准件技术-1 (LF~20/26.5GHz, SOTL类型，难度等级3.0)', '0分', '求职者简历中未提及机械校准件技术，缺乏直接相关经验。']]

for i in default_list:
    print(len(i))
with open("mark_down.md", 'w', encoding="utf8") as file:
    file.write(header("一级目录", 1) + "\n")
    file.write("这是一个文本\n")
    file.write(code_block("import pandas as pd\npd.DataFrame()", "python") + "\n")

    file.write( table_from_rows(default_list))